app/controllers/items_controller.rb

  def add_category
    @item = Item.find(params[:id])
    @category = Category.find(params[:category_id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def categories_items
    @items = Item.includes(:categories).where(categories: { id: params[:category_id]})
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_items" ON "categories"."id" = "categories_items"."category_id" WHERE "categories_items"."item_id" = $1  [["item_id", 1]]