app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # render json: @user
    if @user.save
---
INSERT INTO "users" ("username", "email", "address", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def user_items
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]